Continued apply output from previous comment.
<details><summary>Show Output</summary>

```diff
analyses-filtering_terms_post: Refreshing state... [id=agi-auudf51p4c-a62i9b-POST]
module.sbeacon.aws_api_gateway_integration.analyses-id-g_variants: Refreshing state... [id=agi-auudf51p4c-vxkjof-GET]
module.sbeacon.aws_api_gateway_integration.analyses-id: Refreshing state... [id=agi-auudf51p4c-3o2mt5-GET]
module.sbeacon.aws_api_gateway_integration.analyses-filtering_terms: Refreshing state... [id=agi-auudf51p4c-a62i9b-GET]
module.sbeacon.aws_api_gateway_integration.analyses-id-g_variants_post: Refreshing state... [id=agi-auudf51p4c-vxkjof-POST]
module.sbeacon.aws_api_gateway_integration.analyses-id_post: Refreshing state... [id=agi-auudf51p4c-3o2mt5-POST]
module.sbeacon.aws_api_gateway_integration.analyses_post: Refreshing state... [id=agi-auudf51p4c-1q0gx4-POST]
module.sbeacon.aws_api_gateway_integration.analyses: Refreshing state... [id=agi-auudf51p4c-1q0gx4-GET]
module.sbeacon.aws_api_gateway_integration.biosamples-filtering_terms: Refreshing state... [id=agi-auudf51p4c-nftwai-GET]
module.sbeacon.aws_api_gateway_integration.biosamples_post: Refreshing state... [id=agi-auudf51p4c-6bnaby-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-id_post: Refreshing state... [id=agi-auudf51p4c-q1jifp-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-filtering_terms_post: Refreshing state... [id=agi-auudf51p4c-nftwai-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-id-g_variants_post: Refreshing state... [id=agi-auudf51p4c-pgsebc-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-id: Refreshing state... [id=agi-auudf51p4c-q1jifp-GET]
module.sbeacon.aws_api_gateway_integration.biosamples-id-runs: Refreshing state... [id=agi-auudf51p4c-j0sm1h-GET]
module.sbeacon.aws_api_gateway_integration.biosamples-id-runs_post: Refreshing state... [id=agi-auudf51p4c-j0sm1h-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-id-analyses_post: Refreshing state... [id=agi-auudf51p4c-1yp0in-POST]
module.sbeacon.aws_api_gateway_integration.biosamples: Refreshing state... [id=agi-auudf51p4c-6bnaby-GET]
module.sbeacon.aws_api_gateway_integration.biosamples-id-g_variants: Refreshing state... [id=agi-auudf51p4c-pgsebc-GET]
module.sbeacon.aws_api_gateway_integration.biosamples-id-analyses: Refreshing state... [id=agi-auudf51p4c-1yp0in-GET]
module.sbeacon.aws_lambda_permission.APIbiosamplesIdg_variants: Refreshing state... [id=AllowAPIbiosamplesIdg_variantsInvoke]
module.sbeacon.aws_lambda_permission.APIbiosamplesFilteringTerms: Refreshing state... [id=AllowAPIbiosamplesFilteringTermsInvoke]
module.sbeacon.aws_lambda_permission.APIbiosamplesId: Refreshing state... [id=AllowAPIbiosamplesIdInvoke]
module.sbeacon.aws_lambda_permission.APIbiosamples: Refreshing state... [id=AllowAPIbiosamplesInvoke]
module.sbeacon.aws_lambda_permission.APIbiosamplesIdanalyses: Refreshing state... [id=AllowAPIbiosamplesIdanalysesInvoke]
module.sbeacon.aws_lambda_permission.APIbiosamplesIdruns: Refreshing state... [id=AllowAPIbiosamplesIdrunsInvoke]
module.sbeacon.aws_api_gateway_integration.runs_post: Refreshing state... [id=agi-auudf51p4c-j5giw6-POST]
module.sbeacon.aws_api_gateway_integration.runs-filtering_terms_post: Refreshing state... [id=agi-auudf51p4c-vqjww2-POST]
module.sbeacon.aws_api_gateway_integration.runs-id: Refreshing state... [id=agi-auudf51p4c-kga52w-GET]
module.sbeacon.aws_api_gateway_integration.runs-id-g_variants_post: Refreshing state... [id=agi-auudf51p4c-yoq0wr-POST]
module.sbeacon.aws_api_gateway_integration.runs-id-analyses: Refreshing state... [id=agi-auudf51p4c-ho1m5d-GET]
module.sbeacon.aws_api_gateway_integration.runs-filtering_terms: Refreshing state... [id=agi-auudf51p4c-vqjww2-GET]
module.sbeacon.aws_api_gateway_integration.runs-id-g_variants: Refreshing state... [id=agi-auudf51p4c-yoq0wr-GET]
module.sbeacon.aws_api_gateway_integration.runs-id_post: Refreshing state... [id=agi-auudf51p4c-kga52w-POST]
module.sbeacon.aws_api_gateway_integration.runs: Refreshing state... [id=agi-auudf51p4c-j5giw6-GET]
module.sbeacon.aws_api_gateway_integration.runs-id-analyses_post: Refreshing state... [id=agi-auudf51p4c-ho1m5d-POST]
module.sbeacon.aws_lambda_permission.APIrunsIdanalyses: Refreshing state... [id=AllowAPIrunsIdanalysesInvoke]
module.sbeacon.aws_lambda_permission.APIruns: Refreshing state... [id=AllowAPIrunsInvoke]
module.sbeacon.aws_lambda_permission.APIrunsIdg_variants: Refreshing state... [id=AllowAPIrunsIdg_variantsInvoke]
module.sbeacon.aws_lambda_permission.APIrunsId: Refreshing state... [id=AllowAPIrunsIdInvoke]
module.sbeacon.aws_lambda_permission.APIrunsFilteringTerms: Refreshing state... [id=AllowAPIrunsFilteringTermsInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsId: Refreshing state... [id=AllowAPIdatasetsIdInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsIdbiosamples: Refreshing state... [id=AllowAPIdatasetsIdbiosamplesInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsIdfiltering_terms: Refreshing state... [id=AllowAPIdatasetsIdfiltering_termsInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsIdindividuals: Refreshing state... [id=AllowAPIdatasetsIdindividualsInvoke]
module.sbeacon.aws_lambda_permission.APIdatasets: Refreshing state... [id=AllowAPIdatasetsInvoke]
module.sbeacon.aws_api_gateway_integration.datasets: Refreshing state... [id=agi-auudf51p4c-o1bur6-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id-g_variants: Refreshing state... [id=agi-auudf51p4c-y5t5hi-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id-g_variants_post: Refreshing state... [id=agi-auudf51p4c-y5t5hi-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id: Refreshing state... [id=agi-auudf51p4c-fyhv7o-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id-individuals_post: Refreshing state... [id=agi-auudf51p4c-ubnq59-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id-individuals: Refreshing state... [id=agi-auudf51p4c-ubnq59-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id_post: Refreshing state... [id=agi-auudf51p4c-fyhv7o-POST]
module.sbeacon.aws_lambda_permission.APIdatasetsFilteringTerms: Refreshing state... [id=AllowAPIdatasetsFilteringTermsInvoke]
module.sbeacon.aws_api_gateway_integration.datasets-id-filtering_terms: Refreshing state... [id=agi-auudf51p4c-tx4nza-GET]
module.sbeacon.aws_api_gateway_integration.datasets-filtering_terms_post: Refreshing state... [id=agi-auudf51p4c-jnmq3v-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id-biosamples: Refreshing state... [id=agi-auudf51p4c-3vivi6-GET]
module.sbeacon.aws_api_gateway_integration.datasets-filtering_terms: Refreshing state... [id=agi-auudf51p4c-jnmq3v-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id-biosamples_post: Refreshing state... [id=agi-auudf51p4c-3vivi6-POST]
module.sbeacon.aws_lambda_permission.APIdatasetsIdg_variants: Refreshing state... [id=AllowAPIdatasetsIdg_variantsInvoke]
module.sbeacon.aws_api_gateway_integration.datasets-id-filtering_terms_post: Refreshing state... [id=agi-auudf51p4c-tx4nza-POST]
module.sbeacon.aws_api_gateway_integration_response.individuals-id-g_variants: Refreshing state... [id=agir-auudf51p4c-facarh-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals: Refreshing state... [id=agir-auudf51p4c-u79iwd-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id-g_variants_post: Refreshing state... [id=agir-auudf51p4c-facarh-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-filtering_terms: Refreshing state... [id=agir-auudf51p4c-3jtaho-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id: Refreshing state... [id=agir-auudf51p4c-sjks3s-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-filtering_terms_post: Refreshing state... [id=agir-auudf51p4c-3jtaho-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id_post: Refreshing state... [id=agir-auudf51p4c-sjks3s-POST-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-filtering_terms_post: Refreshing state... [id=agir-auudf51p4c-a62i9b-POST-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-id-g_variants: Refreshing state... [id=agir-auudf51p4c-vxkjof-GET-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-id: Refreshing state... [id=agir-auudf51p4c-3o2mt5-GET-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-filtering_terms: Refreshing state... [id=agir-auudf51p4c-a62i9b-GET-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-id-g_variants_post: Refreshing state... [id=agir-auudf51p4c-vxkjof-POST-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-id_post: Refreshing state... [id=agir-auudf51p4c-3o2mt5-POST-200]
module.sbeacon.aws_api_gateway_integration_response.analyses_post: Refreshing state... [id=agir-auudf51p4c-1q0gx4-POST-200]
module.sbeacon.aws_api_gateway_integration_response.analyses: Refreshing state... [id=agir-auudf51p4c-1q0gx4-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-filtering_terms: Refreshing state... [id=agir-auudf51p4c-nftwai-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples_post: Refreshing state... [id=agir-auudf51p4c-6bnaby-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id_post: Refreshing state... [id=agir-auudf51p4c-q1jifp-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-filtering_terms_post: Refreshing state... [id=agir-auudf51p4c-nftwai-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-g_variants_post: Refreshing state... [id=agir-auudf51p4c-pgsebc-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id: Refreshing state... [id=agir-auudf51p4c-q1jifp-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals_post: Refreshing state... [id=agir-auudf51p4c-u79iwd-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id-biosamples: Refreshing state... [id=agir-auudf51p4c-nb8c7s-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples: Refreshing state... [id=agir-auudf51p4c-6bnaby-GET-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id_post: Refreshing state... [id=agir-auudf51p4c-3n9fhg-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-g_variants: Refreshing state... [id=agir-auudf51p4c-pgsebc-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs_post: Refreshing state... [id=agir-auudf51p4c-j5giw6-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-runs: Refreshing state... [id=agir-auudf51p4c-j0sm1h-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-runs_post: Refreshing state... [id=agir-auudf51p4c-j0sm1h-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id-g_variants_post: Refreshing state... [id=agir-auudf51p4c-yoq0wr-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-analyses: Refreshing state... [id=agir-auudf51p4c-1yp0in-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id-analyses: Refreshing state... [id=agir-auudf51p4c-ho1m5d-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-filtering_terms: Refreshing state... [id=agir-auudf51p4c-vqjww2-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-filtering_terms_post: Refreshing state... [id=agir-auudf51p4c-vqjww2-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id: Refreshing state... [id=agir-auudf51p4c-kga52w-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id-analyses_post: Refreshing state... [id=agir-auudf51p4c-ho1m5d-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets: Refreshing state... [id=agir-auudf51p4c-o1bur6-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-g_variants: Refreshing state... [id=agir-auudf51p4c-y5t5hi-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-g_variants_post: Refreshing state... [id=agir-auudf51p4c-y5t5hi-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id_post: Refreshing state... [id=agir-auudf51p4c-kga52w-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id: Refreshing state... [id=agir-auudf51p4c-fyhv7o-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-individuals_post: Refreshing state... [id=agir-auudf51p4c-ubnq59-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-individuals: Refreshing state... [id=agir-auudf51p4c-ubnq59-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id_post: Refreshing state... [id=agir-auudf51p4c-fyhv7o-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-filtering_terms: Refreshing state... [id=agir-auudf51p4c-tx4nza-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-biosamples: Refreshing state... [id=agir-auudf51p4c-3vivi6-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs: Refreshing state... [id=agir-auudf51p4c-j5giw6-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-biosamples_post: Refreshing state... [id=agir-auudf51p4c-3vivi6-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id-biosamples_post: Refreshing state... [id=agir-auudf51p4c-nb8c7s-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-filtering_terms_post: Refreshing state... [id=agir-auudf51p4c-tx4nza-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id: Refreshing state... [id=agir-auudf51p4c-3n9fhg-GET-200]
module.sbeacon.aws_api_gateway_method_response.datasets_post: Refreshing state... [id=agmr-auudf51p4c-o1bur6-POST-200]
module.sbeacon.aws_api_gateway_integration.datasets_post: Refreshing state... [id=agi-auudf51p4c-o1bur6-POST]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-individuals_post: Refreshing state... [id=agir-auudf51p4c-19r55o-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id-g_variants: Refreshing state... [id=agir-auudf51p4c-yoq0wr-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-filtering_terms_post: Refreshing state... [id=agir-auudf51p4c-jnmq3v-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-filtering_terms: Refreshing state... [id=agir-auudf51p4c-jnmq3v-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets_post: Refreshing state... [id=agir-auudf51p4c-o1bur6-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-analyses_post: Refreshing state... [id=agir-auudf51p4c-1yp0in-POST-200]
module.sbeacon.module.cors-datasets-filtering_terms.aws_api_gateway_integration_response._: Refreshing state... [id=agir-auudf51p4c-jnmq3v-OPTIONS-200]
module.sbeacon.aws_api_gateway_deployment.BeaconApi: Refreshing state... [id=axo133]
module.sbeacon.aws_api_gateway_stage.BeaconApi: Refreshing state... [id=ags-auudf51p4c-prod]
module.sbeacon.aws_api_gateway_method_settings.BeaconApi: Refreshing state... [id=auudf51p4c-prod-*/*]
module.sbeacon.aws_cloudfront_distribution.api_distribution: Refreshing state... [id=E1ACA5WT51ELER]
module.webgui.data.external.build: Reading...
module.webgui.aws_cloudfront_response_headers_policy.bui-security-headers-policy: Refreshing state... [id=b8634475-d812-42ad-9dde-cd31725a80cb]
module.webgui.aws_cloudfront_distribution.bui-s3-distribution: Refreshing state... [id=E8Z5K385KM143]
module.webgui.data.aws_iam_policy_document.s3_access_from_cloudfront: Reading...
module.webgui.data.aws_iam_policy_document.s3_access_from_cloudfront: Read complete after 0s [id=4144518607]
module.webgui.aws_ssm_parameter.bui-ssm-beacon-ui-url: Refreshing state... [id=bui-ssm-beacon-ui-url]
module.webgui.aws_s3_bucket_policy.s3_access_from_cloudfront: Refreshing state... [id=webgui-bucket-20250513021738584800000001]
module.webgui.data.external.build: Still reading... [10s elapsed]
module.webgui.data.external.build: Still reading... [20s elapsed]
module.webgui.data.external.build: Still reading... [30s elapsed]
module.webgui.data.external.build: Still reading... [40s elapsed]
module.webgui.data.external.build: Still reading... [50s elapsed]
module.webgui.data.external.build: Still reading... [1m0s elapsed]
module.webgui.data.external.build: Still reading... [1m10s elapsed]
module.webgui.data.external.build: Read complete after 1m19s [id=-]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.sbeacon.aws_lambda_layer_version.binaries_layer must be replaced
+/- resource "aws_lambda_layer_version" "binaries_layer" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_binaries_layer:10" -> (known after apply)
      ~ code_sha256                 = "agXvxR7kYeivEVBkDSVazE4Uiw8hR5S4c0VGDLAVQXE=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-09-18T02:30:55.715+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_binaries_layer:10" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_binaries_layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "craw3IhLR+LMdnMylQDDS1+dnR5NxKeafS1qE82BEcqHZjw68JhWJgKz82DGANq5fO79HzvOuXyuHwWd5iwnaA==" -> "U6qNt5zMIu2APGjs+7Sh0kPuQWCsZcG+HJwK+IbnAn4/kaYZonz2qtxxGSNx/BJ2MjWEpn7dvDb1pLIiYne5Mw==" # forces replacement
      ~ source_code_size            = 18449795 -> (known after apply)
      ~ version                     = "10" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.aws_lambda_layer_version.binaries_layer (deposed object 4561c3d2) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_lambda_layer_version" "binaries_layer" {
      - arn                         = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_binaries_layer:9" -> null
      - code_sha256                 = "0sdaIDREVWtyxVsqKU9Zm2Bzzf1WzwGV9F0tVfSKdpc=" -> null
      - compatible_architectures    = [] -> null
      - compatible_runtimes         = [
          - "python3.12",
        ] -> null
      - created_date                = "2025-08-25T08:48:03.559+0000" -> null
      - filename                    = "sbeacon/binaries.zip" -> null
      - id                          = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_binaries_layer:9" -> null
      - layer_arn                   = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_binaries_layer" -> null
      - layer_name                  = "sbeacon_backend_binaries_layer" -> null
      - region                      = "ap-southeast-3" -> null
      - skip_destroy                = false -> null
      - source_code_hash            = "k1Jnw+dc3n30iVkfZznhVmxazHxQ5+9+NMzBYA1wzPGkqh0E+75QXUNlCClFp/YdiojC/7qs55E5W+7yuIuMew==" -> null
      - source_code_size            = 18422754 -> null
      - version                     = "9" -> null
        # (4 unchanged attributes hidden)
    }

  # module.sbeacon.aws_s3_bucket_notification.updateFiles will be updated in-place
  ~ resource "aws_s3_bucket_notification" "updateFiles" {
      ~ eventbridge = true -> false
        id          = "gasi-dataportal-20250513021720562800000002"
        # (2 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.svep[0].aws_lambda_layer_version.binaries_layer must be replaced
+/- resource "aws_lambda_layer_version" "binaries_layer" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer:11" -> (known after apply)
      ~ code_sha256                 = "IeRlFg7Uq19pK/SsGQlfX3SVocxGUceYXFViB8J1W7k=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-09-18T02:30:54.079+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer:11" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "CwQy6drTPtMsrX2wUKyqTty3/iNtAvaJApjJ4bUgMzjkVHTUs1yuVOcksj1qgjBOVKmL+kK5pAcpceTnNX/PZg==" -> "3L2Us24N3kN6RdJUIRbr6Q3j+++CaGDpk2sNBZ0vHW+lhjUt00qm3205W/vaI4FIz3CvU2K9S/1qqpEl4gcyMw==" # forces replacement
      ~ source_code_size            = 17976008 -> (known after apply)
      ~ version                     = "11" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.svep[0].aws_lambda_layer_version.binaries_layer (deposed object f5ad4c31) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_lambda_layer_version" "binaries_layer" {
      - arn                         = "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer:10" -> null
      - code_sha256                 = "SlHR/jYXtfdAZFPdPGbWE8Dkbu/uyc/0ceVSDjKMzD0=" -> null
      - compatible_architectures    = [] -> null
      - compatible_runtimes         = [
          - "python3.12",
        ] -> null
      - created_date                = "2025-08-25T08:47:58.074+0000" -> null
      - filename                    = "svep/binaries.zip" -> null
      - id                          = "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer:10" -> null
      - layer_arn                   = "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer" -> null
      - layer_name                  = "svep_backend_binaries_layer" -> null
      - region                      = "ap-southeast-3" -> null
      - skip_destroy                = false -> null
      - source_code_hash            = "IJ1Y7lgbRmoG/884OjFCZSALSJaiqFmYDMItgvc1mBHD9zyryb+yui059UdJK9RuZickHcV4TyNbr6tC8uv6ng==" -> null
      - source_code_size            = 17951206 -> null
      - version                     = "10" -> null
        # (4 unchanged attributes hidden)
    }

  # module.webgui.aws_s3_object.version will be updated in-place
  ~ resource "aws_s3_object" "version" {
      ~ content                       = "v1.1.0-62-g0067837e+" -> "v1.1.0-60-ga6ba1ee5+"
        id                            = "version.txt"
        tags                          = {}
      + version_id                    = (known after apply)
        # (25 unchanged attributes hidden)
    }

  # module.webgui.null_resource.cloudfront-invalidate will be created
  + resource "null_resource" "cloudfront-invalidate" {
      + id       = (known after apply)
      + triggers = {
          + "compiled_code_hash" = "23e6e538c25cb6213c04ee319214ff9927cb2b2c"
        }
    }

  # module.webgui.null_resource.s3-upload will be created
  + resource "null_resource" "s3-upload" {
      + id       = (known after apply)
      + triggers = {
          + "build_file_hash"    = "caab493802eac5ae99fb1979ad045b4f3c946757"
          + "compiled_code_hash" = "23e6e538c25cb6213c04ee319214ff9927cb2b2c"
        }
    }

  # module.webgui.terraform_data.cloudfront-version-invalidate will be created
  + resource "terraform_data" "cloudfront-version-invalidate" {
      + id               = (known after apply)
      + triggers_replace = [
          + "v1.1.0-60-ga6ba1ee5+",
        ]
    }

  # module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4631338186453466072" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758162480843819000" -> "1758249672256296000"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] (deposed object 77d7ab84) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "6684673487492547697" -> null
      - triggers = {
          - "filename"  = "builds/2a66512866b4ba2207cf913d887b0861be7503e766dae546cfba8cf56e62fdc3.zip"
          - "timestamp" = "1756111467477174000"
        } -> null
    }

  # module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5993219346941551052" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758162480943997000" -> "1758249672148424000"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5241639810111639175" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758162480826278000" -> "1758249672522024000"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0] (deposed object 1cb59918) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "7753067421631592020" -> null
      - triggers = {
          - "filename"  = "builds/8225510b62bf60b687b5614da58232658f9caa7053aed32e35c914e3cf72c09e.zip"
          - "timestamp" = "1756111467570158000"
        } -> null
    }

  # module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4860257831601445548" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758162480922983800" -> "1758249672825185000"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] (deposed object 91accdc9) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "7857361313463266314" -> null
      - triggers = {
          - "filename"  = "builds/0ab4695261445c275b666691d159b2827f1a283a9dbdb793347795a9ed72494d.zip"
          - "timestamp" = "1756111466023865000"
        } -> null
    }

  # module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4346340681080815885" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758162471823831000" -> "1758249672323536000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_image.this must be replaced
+/- resource "docker_image" "this" {
      ~ id           = "sha256:fe1ddc86c345d23b3e9f59e80fca8f336455f9fd3ae6ec42472f6eabf03e4afd460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers" -> (known after apply)
      ~ image_id     = "sha256:fe1ddc86c345d23b3e9f59e80fca8f336455f9fd3ae6ec42472f6eabf03e4afd" -> (known after apply)
        name         = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      ~ repo_digest  = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers@sha256:f8dd9fcb89067d7ca25ba3a0097abbed354bc318932314fd3ec25bc9ea212c16" -> (known after apply)
      ~ triggers     = { # forces replacement
          ~ "dir_sha" = "d85f7a7f980aa38a9945648dd869683ef2bce09b" -> "10c463e0bc00da355d7c04fa3e806fe53541bce3"
        }
        # (2 unchanged attributes hidden)

      - build {
          - build_args      = {
              - "SHARED_LAYER_PATH" = "sbeacon/shared_resources/python-modules/python/shared"
            } -> null
          - cache_from      = [] -> null
          - context         = "sbeacon/lambda/submitDataset" -> null
          - cpu_period      = 0 -> null
          - cpu_quota       = 0 -> null
          - cpu_shares      = 0 -> null
          - dockerfile      = "Dockerfile" -> null
          - extra_hosts     = [] -> null
          - force_remove    = false -> null
          - label           = {} -> null
          - labels          = {} -> null
          - memory          = 0 -> null
          - memory_swap     = 0 -> null
          - no_cache        = false -> null
          - platform        = "linux/amd64" -> null
          - pull_parent     = false -> null
          - remove          = true -> null
          - security_opt    = [] -> null
          - shm_size        = 0 -> null
          - squash          = false -> null
          - suppress_output = false -> null
          - tag             = [] -> null
            # (12 unchanged attributes hidden)
        }
      + build {
          + build_args     = {
              + "SHARED_LAYER_PATH" = "sbeacon/shared_resources/python-modules/python/shared"
            }
          + cache_from     = []
          + context        = "sbeacon/lambda/submitDataset"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:f8dd9fcb89067d7ca25ba3a0097abbed354bc318932314fd3ec25bc9ea212c16" -> (known after apply)
        name                 = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      ~ sha256_digest        = "sha256:f8dd9fcb89067d7ca25ba3a0097abbed354bc318932314fd3ec25bc9ea212c16" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "d85f7a7f980aa38a9945648dd869683ef2bce09b" -> "10c463e0bc00da355d7c04fa3e806fe53541bce3"
        }
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_registry_image.this (deposed object 6b1bc411) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "docker_registry_image" "this" {
      - id                   = "sha256:ef44164a9a01fd76c5734330c3ae7af9c21c7a58a0710a4e36f873226ec86ff2" -> null
      - insecure_skip_verify = false -> null
      - keep_remotely        = false -> null
      - name                 = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers" -> null
      - sha256_digest        = "sha256:f8dd9fcb89067d7ca25ba3a0097abbed354bc318932314fd3ec25bc9ea212c16" -> null
      - triggers             = {
          - "dir_sha" = "15dc9b9bc282ff832f3ad6ffb55228cea885fa4b"
        } -> null
    }

  # module.sbeacon.module.lambda-admin.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/de823e6698d74d5e282d9a74703d54980cd3b566a4ed6f3f53c04cbf5f09c4b6.zip" -> "builds/bef328ffafbb58749d9e45a244454eb34d7530371373dd3e6e248c982408d449.zip"
        id                             = "sbeacon-backend-admin"
      ~ last_modified                  = "2025-09-18T04:09:48.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:10",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-admin.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/admin",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/bef328ffafbb58749d9e45a244454eb34d7530371373dd3e6e248c982408d449.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/bef328ffafbb58749d9e45a244454eb34d7530371373dd3e6e248c982408d449.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-admin.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7081144769793277829" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/de823e6698d74d5e282d9a74703d54980cd3b566a4ed6f3f53c04cbf5f09c4b6.zip" -> "builds/bef328ffafbb58749d9e45a244454eb34d7530371373dd3e6e248c982408d449.zip"
          ~ "timestamp" = "1758162472320482000" -> "1758249672663785000"
        }
    }

  # module.sbeacon.module.lambda-admin.null_resource.archive[0] (deposed object 51c8cc81) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "499175919151756308" -> null
      - triggers = {
          - "filename"  = "builds/17ff32aa9bf57b5c9f996b78f05ce51a63a1b1cec104c63f3c98a174beb17bb2.zip"
          - "timestamp" = "1756111467134071200"
        } -> null
    }

  # module.sbeacon.module.lambda-data-portal.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/fa58a01d99f45d7a953775a8a88f96d73bbafc98d2c79b28402755b6d8cfd113.zip" -> "builds/739a5fbb8e209bb90d2ad2918e2de3d4dc65f3330cfc1ee09621aab5029b2398.zip"
        id                             = "sbeacon-backend-dataPortal"
      ~ last_modified                  = "2025-08-25T08:50:38.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:12",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:9",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-data-portal.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "pip",
                          + "python3.12",
                          + "sbeacon/lambda/dataPortal/requirements.txt",
                          + null,
                          + null,
                        ],
                      + [
                          + "zip",
                          + "sbeacon/lambda/dataPortal",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/739a5fbb8e209bb90d2ad2918e2de3d4dc65f3330cfc1ee09621aab5029b2398.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/739a5fbb8e209bb90d2ad2918e2de3d4dc65f3330cfc1ee09621aab5029b2398.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-data-portal.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7244452706428372692" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/89abea36a8cf0e00358de9e170e2f251e431e6ea4679e8074697691eaca542c7.zip" -> "builds/739a5fbb8e209bb90d2ad2918e2de3d4dc65f3330cfc1ee09621aab5029b2398.zip"
          ~ "timestamp" = "1758162474033735000" -> "1758249673652764000"
        }
    }

  # module.sbeacon.module.lambda-data-portal.null_resource.archive[0] (deposed object dcccd3f2) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "6988839606635245157" -> null
      - triggers = {
          - "filename"  = "builds/fa58a01d99f45d7a953775a8a88f96d73bbafc98d2c79b28402755b6d8cfd113.zip"
          - "timestamp" = "1756111466360932200"
        } -> null
    }

  # module.sbeacon.module.lambda-deidentifyFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-deidentifyFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:10",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_binaries_layer:10",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4019411715447240722" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758162474945461000" -> "1758249672541502000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-generateCohortVCfs"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:10",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_binaries_layer:10",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7131124403469568457" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758162472629585000" -> "1758249673183765000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0] (deposed object ea1856f5) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "9153888412160774790" -> null
      - triggers = {
          - "filename"  = "builds/2fed43367c56d0422d0098b15003d4ff9ae27cf689d7cfee7a7a5289345d6cc6.zip"
          - "timestamp" = "1756111466727500000"
        } -> null
    }

  # module.sbeacon.module.lambda-generateReports.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/0300e75b7f536502cf4a1de5308dcfa7fc3b7756791a2ad0c7579e34a8fcf036.zip" -> "builds/10bc5eab17cd145a6b5e9de120c5d273e97ccc28105eab53877a955b44ef6578.zip"
        id                             = "sbeacon-backend-generateReports"
      ~ last_modified                  = "2025-08-25T08:48:17.459+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-generateReports.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "pip",
                          + "python3.12",
                          + "sbeacon/lambda/generateReports/requirements.txt",
                          + null,
                          + null,
                        ],
                      + [
                          + "zip",
                          + "sbeacon/lambda/generateReports",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/10bc5eab17cd145a6b5e9de120c5d273e97ccc28105eab53877a955b44ef6578.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/10bc5eab17cd145a6b5e9de120c5d273e97ccc28105eab53877a955b44ef6578.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-generateReports.null_resource.archive[0] is tainted, so must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1425638675701595325" -> (known after apply)
      ~ triggers = {
          ~ "filename"  = "builds/3f0ca2e3ff80dc59fa3d9c8efc3a6a96ad8109a75a92dc97b77e9405f46cc15e.zip" -> "builds/10bc5eab17cd145a6b5e9de120c5d273e97ccc28105eab53877a955b44ef6578.zip"
          ~ "timestamp" = "1758168312718117000" -> "1758249673152322000"
        }
    }

  # module.sbeacon.module.lambda-generateReports.null_resource.archive[0] (deposed object 91238e89) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "8852114330341970823" -> null
      - triggers = {
          - "filename"  = "builds/0300e75b7f536502cf4a1de5308dcfa7fc3b7756791a2ad0c7579e34a8fcf036.zip"
          - "timestamp" = "1756111466863931000"
        } -> null
    }

  # module.sbeacon.module.lambda-generateReports.null_resource.archive[0] (deposed object 93275ccd) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "3990690605240843461" -> null
      - triggers = {
          - "filename"  = "builds/3f0ca2e3ff80dc59fa3d9c8efc3a6a96ad8109a75a92dc97b77e9405f46cc15e.zip"
          - "timestamp" = "1758162473455304000"
        } -> null
    }

  # module.sbeacon.module.lambda-getAnalyses.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getAnalyses"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:10",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8397206699075853489" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758162475333116000" -> "1758249673840722000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (deposed object cdc864f9) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "4695511287234543700" -> null
      - triggers = {
          - "filename"  = "builds/a7bd83ed0d8a536495679c588b7db329d03eb49388aab75337bf8432251682e3.zip"
          - "timestamp" = "1756111467369546000"
        } -> null
    }

  # module.sbeacon.module.lambda-getBiosamples.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getBiosamples"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:10",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5367994362180388986" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758162472458920000" -> "1758249672739752000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (deposed object 92766352) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "9210519233497162754" -> null
      - triggers = {
          - "filename"  = "builds/45d2eecf1b7259072f636aa61cf33b646d8982a40e93a0231fa59ad8592f3066.zip"
          - "timestamp" = "1756111467767656000"
        } -> null
    }

  # module.sbeacon.module.lambda-getConfiguration.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getConfiguration"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:10",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "266926870119359430" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758162471581040000" -> "1758249673243649000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] (deposed object f48254af) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "798892279029106317" -> null
      - triggers = {
          - "filename"  = "builds/bdfd549747da6fdfb5247f317d63fae8452b23a25d28d2bec5c967ba3341d016.zip"
          - "timestamp" = "1756111467139458800"
        } -> null
    }

  # module.sbeacon.module.lambda-getDatasets.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/632488536b796872d1863707cdd11d85a1dd8af4e2f3c3ad65d230a1552cd62b.zip" -> "builds/6362c9f82d7b6f6f9ff710730a6ff0cd71f65872a9d7246a03d6245c5fa5aa5e.zip"
        id                             = "sbeacon-backend-getDatasets"
      ~ last_modified                  = "2025-09-18T04:10:21.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:10",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getDatasets.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/getDatasets",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/6362c9f82d7b6f6f9ff710730a6ff0cd71f65872a9d7246a03d6245c5fa5aa5e.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/6362c9f82d7b6f6f9ff710730a6ff0cd71f65872a9d7246a03d6245c5fa5aa5e.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getDatasets.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "419430831239356428" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/632488536b796872d1863707cdd11d85a1dd8af4e2f3c3ad65d230a1552cd62b.zip" -> "builds/6362c9f82d7b6f6f9ff710730a6ff0cd71f65872a9d7246a03d6245c5fa5aa5e.zip"
          ~ "timestamp" = "1758162472535298200" -> "1758249673347523000"
        }
    }

  # module.sbeacon.module.lambda-getDatasets.null_resource.archive[0] (deposed object 91168d04) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "7695704126110082091" -> null
      - triggers = {
          - "filename"  = "builds/19039ae9583ed19cd0983db81dd4c9470a66bd4082d06488091b82fef2205c71.zip"
          - "timestamp" = "1756111467862540000"
        } -> null
    }

  # module.sbeacon.module.lambda-getEntryTypes.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getEntryTypes"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:10",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6609370973958808229" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758162472233323000" -> "1758249673654057000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] (deposed object ee1488e3) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "6782779297099141204" -> null
      - triggers = {
          - "filename"  = "builds/238c996d7bde89f739f1e7095110c69c47ce7589b588b35ea1f94beaf9b14210.zip"
          - "timestamp" = "1756111466446140000"
        } -> null
    }

  # module.sbeacon.module.lambda-getFilteringTerms.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getFilteringTerms"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:10",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6194094341039815706" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758162473368834000" -> "1758249673855614000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] (deposed object 2a4b13de) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "6785143689445204482" -> null
      - triggers = {
          - "filename"  = "builds/454b6d5e06b61167a7515cba40e977ff31c8f2db728e6c419afec860c13d5c85.zip"
          - "timestamp" = "1756111467234299800"
        } -> null
    }

  # module.sbeacon.module.lambda-getGenomicVariants.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getGenomicVariants"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:10",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1965087288960448800" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758162472542727000" -> "1758249673369207000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] (deposed object 2f5df225) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "8126604345263468201" -> null
      - triggers = {
          - "filename"  = "builds/03cd2c3a98ebceb946ba1918b071fc2ed8a8e44431aa9ceb30659f6b1a23bb97.zip"
          - "timestamp" = "1756111466851289000"
        } -> null
    }

  # module.sbeacon.module.lambda-getIndividuals.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getIndividuals"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:10",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1223406225516832511" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758162472444405000" -> "1758249672881814000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (deposed object d07b6153) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "3581614039743005051" -> null
      - triggers = {
          - "filename"  = "builds/54d135633142b071ec455b6045d8f1cbc9c559b03c00a6311b967298b458ab40.zip"
          - "timestamp" = "1756111466070144800"
        } -> null
    }

  # module.sbeacon.module.lambda-getInfo.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getInfo"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:10",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getInfo.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2222007108004146220" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758162475670545200" -> "1758249673518092000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getInfo.null_resource.archive[0] (deposed object a3a35e77) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "5474086431704061865" -> null
      - triggers = {
          - "filename"  = "builds/549ea2149ce3f8600d7817b5ad724fa92298664f34913190d9d5c78566719e70.zip"
          - "timestamp" = "1756111466422108000"
        } -> null
    }

  # module.sbeacon.module.lambda-getMap.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getMap"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:10",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getMap.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8681426599251965849" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758162473143224000" -> "1758249672655258000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getMap.null_resource.archive[0] (deposed object 397bde8f) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "3453720856251484229" -> null
      - triggers = {
          - "filename"  = "builds/6e74e5347aeb09443a9bcfb7a1b7f282d19c03509066e7bd1bfa6ff3d1787540.zip"
          - "timestamp" = "1756111467025538000"
        } -> null
    }

  # module.sbeacon.module.lambda-getProjects.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getProjects"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:10",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getProjects.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8637098692764308353" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758162472639720000" -> "1758249672720316000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (deposed object ec04f045) will be destroyed
  # (left over from a partially
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.